# Enter your network definition here.
# Use Shift+Enter to update the visualization.
name: "Vggs-part"

input: "top_0"
input_shape {
  dim: 64
  dim: 3
  dim: 227
  dim: 227
}
input: "top_1"
input_shape {
  dim: 64
  dim: 3
  dim: 227
  dim: 227
}
input: "top_2"
input_shape {
  dim: 64
  dim: 3
  dim: 227
  dim: 227
}
input: "top_3"
input_shape {
  dim: 64
}
layer {
  bottom: "top_0"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
 
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
  }
}
layer {
  bottom: "top_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
 
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
  }
}
layer {
  bottom: "top_2"
  top: "conv1_3"
  name: "conv1_3"
  type: "Convolution"
 
  convolution_param {
    num_output: 96
    kernel_size: 7
    stride: 2
  }
}

layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}

layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_3"
  top: "conv1_3"
  name: "relu1_3"
  type: "ReLU"
}

layer {
  bottom: "conv1_1"
  top: "norm1_1"
  name: "norm1_1"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "conv1_2"
  top: "norm1_2"
  name: "norm1_2"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}

layer {
  bottom: "conv1_3"
  top: "norm1_3"
  name: "norm1_3"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}

layer {
  bottom: "norm1_1"
  top: "pool1_1"
  name: "pool1_1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "norm1_2"
  top: "pool1_2"
  name: "pool1_2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}

layer {
  bottom: "norm1_3"
  top: "pool1_3"
  name: "pool1_3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}

layer {
  bottom: "pool1_1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    kernel_size: 5
  }
}
layer {
  bottom: "pool1_2"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    kernel_size: 5
  }
}
layer {
  bottom: "pool1_3"
  top: "conv2_3"
  name: "conv2_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    kernel_size: 5
  }
}

layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_3"
  top: "conv2_3"
  name: "relu2_3"
  type: "ReLU"
}

layer {
  bottom: "conv2_1"
  top: "pool2_1"
  name: "pool2_1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "conv2_2"
  top: "pool2_2"
  name: "pool2_2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "conv2_3"
  top: "pool2_3"
  name: "pool2_3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2_1"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "pool2_2"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "pool2_3"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
 
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
 
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
 
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "pool5_1"
  name: "pool5_1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "pool5_2"
  name: "pool5_2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "pool5_3"
  name: "pool5_3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  bottom: "pool5_1"
  top: "fc6_1"
  name: "fc6_1"
  type: "InnerProduct"
  param {
    name: "fc6_1_w"
    lr_mult: 10

    decay_mult: 1
  }
  param {
    name: "fc6_1_b"
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "pool5_2"
  top: "fc6_2"
  name: "fc6_2"
  type: "InnerProduct"
  param {
    name: "fc6_2_w"
    lr_mult: 10

    decay_mult: 1
  }
  param {
    name: "fc6_2_b"
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "pool5_3"
  top: "fc6_3"
  name: "fc6_3"
  type: "InnerProduct"
  param {
    name: "fc6_3_w"
    lr_mult: 10

    decay_mult: 1
  }
  param {
    name: "fc6_3_b"
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  bottom: "fc6_1"
  top: "fc6_1"
  name: "relu6_1"
  type: "ReLU"
}
layer {
  bottom: "fc6_2"
  top: "fc6_2"
  name: "relu6_2"
  type: "ReLU"
}
layer {
  bottom: "fc6_3"
  top: "fc6_3"
  name: "relu6_3"
  type: "ReLU"
}
layer {
  bottom: "fc6_1"
  top: "fc6_1"
  name: "drop6_1"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6_2"
  top: "fc6_2"
  name: "drop6_2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6_3"
  top: "fc6_3"
  name: "drop6_3"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "fc6_1"
  bottom: "fc6_2"
  bottom: "fc6_3"
  top: "concate"
  name: "concate"
  type: "Python"

  python_param {
    module: "concate_layer"
    layer: "ConcateLayer"
  }
}
layer {
  bottom: "concate"
  top: "fc7"
  name: "fc7"
  type: "InnerProduct"
  param {
    name: "fc7_w"
    lr_mult: 10

    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 298
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  } 
  
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc7"
  bottom: "top_3"
  top: "accuracy"
  include {
      phase: TEST
    }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc7"
  bottom: "top_3"
  top: "loss"
}
  

